"""1. Написати клас "Карточка на знижку" (DiscountCard), який містить наступну інформацію:

Номер карточки
Розмір знижки (знижка передбачається накопичуваною; на початковому етапі вона рівна 1%. За кожні 1000 грн. покупки, сума знижки збільшується на 1%.)
Приховане допоміжне поле для збереження вартості накупленого товару
Дата видачі карточки в форматі "12/02/1200")
Забезпечити можливість:
Купляти товар з використанням карточки на знижку;
Виводити інформацію про поточну величину знижки;
Виводити інформацію про те, на яку суму ще необхідно докупити товару, щоб величина знижки збільшилась. """
from lib.DiscountCard import Discount_Card

card_1 = Discount_Card()

print(card_1.card_number)

card_1.buy_goods(10000000)


card_1.discount_info()


card_1.discount_inc_info()
